# Úvod do Databáz a DBMS

## 👩‍🔬👨‍🔬 Kurz Data Science (Databázy a Jazyk SQL)
**🧑‍🏫 Lektor:** Miroslav Reiter  
**📥 LinkedIn kontakt:** https://www.linkedin.com/in/miroslav-reiter/  

`*Testovaci* **Text**`

**✅ Osnova:** https://itkurzy.sav.sk/node/195

**🎞️ YouTube videá:** https://www.youtube.com/c/IT-AcademySK  
**📇 Zdrojové kódy a materiály:** https://github.com/miroslav-reiter/Kurzy_SAV_Analytika_Python_R  

**😊 Emojis:** Win + .

# Čo je Databáza?

1. Kontajnér na ukladanie a organizáciu údajov
2. Kolekcia dát, ktoré sú systematicky usporiadané tak, aby bolo možné ľahko pristupovať k nim, spravovať ich a aktualizovať 
3. Sú nevyhnutné pre rôzne aplikácie a organizácie, pretože poskytujú efektívny spôsob, ako ukladať, načítať a analyzovať veľké objemy údajov

# Čo je DBMS (Database Management System)?
* Softvérový nástroj alebo súbor nástrojov používaný na vytváranie, spravovanie a prispôsobovanie databáz 
* Umožňuje používateľom ukladať, spracovávať a analyzovať veľké množstvo štruktúrovanej informácie a spravovať dáta s vysokou účinnosťou a bezpečnosťou

# Príklady Využitia Databáz 
1. Bankovníctvo: Na ukladanie informácií o klientoch, ich účtoch, transakciách, pôžičkách a iných finančných službách
2. **Online obchody a e-commerce**: Na správu eshopu, zákazníckych údajov, objednávok, platobných informácií a historie nákupov
3. Zdravotníctvo: Na ukladanie pacientskych záznamov, lekárskych predpisov, výsledkov testov a informácií o liečbe
4. **Vzdelávanie**: Na správu študentských záznamov, kurzov, známok a registrácie
5. Telekomunikácie: Na správu informácií o zákazníkoch, hovoroch, fakturácii a sieťových dátach
6. Výroba: Na sledovanie výrobných procesov, zásob, objednávok a dodávateľských reťazcov
7. Doprava a logistika: Na sledovanie zásielok, vozového parku, cestovných itinerárov a údajov o preprave
8. Vládne a verejné služby: Na evidenciu občianskych údajov, daňových záznamov, evidencie vozidiel a iných verejných záznamov
9. **Sociálne médiá a online platformy**: Na ukladanie údajov o používateľoch, ich interakciách, príspevkoch a sieťových vzťahoch
10. **Vedecký výskum a dátovej analýzy**: Na ukladanie a analyzovanie veľkých súborov údajov v oblastiach ako genómika, klimatológia, fyzika a mnoho ďalších

# DBMS Funkcie
1. Ukladanie dát: Umožňuje ukladanie rôznych druhov dát v organizovanej forme
2. Manipulácia s dátami: Podpora pre vytváranie, aktualizáciu, mazanie a vyhľadávanie dát
3. Transakčný manažment: Zabezpečuje integritu dát pri súčasnom prístupe viacerých používateľov a zabezpečuje, že všetky transakcie sú kompletné a konzistentné
4. Zabezpečenie a správa oprávnení: Umožňuje definovať, kto má prístup k akým dátam a aké operácie môže s dátami vykonávať
5. Zálohovanie a obnova: Umožňuje zálohovanie dát a ich obnovu v prípade systémového zlyhania alebo straty dát

# Konkrétne DBMS/DB
1. MySQL: Obľúbený open-source relačný databázový systém, ktorý je často používaný v web aplikáciách, vrátane online obchodov a webov
2. PostgreSQL: Vysoko sofistikovaný open-source objektovo-relačný DBMS, známy pre svoju robustnosť, skalovateľnosť a podporu komplexných dátových typov
3. Microsoft SQL Server: Komplexný komerčný DBMS od spoločnosti Microsoft, populárny vo firemnom prostredí, ponúka rozsiahle nástroje a integráciu s inými produktmi Microsoftu
4. Oracle Database: Veľmi výkonný a rozšírený komerčný DBMS, používaný hlavne veľkými spoločnosťami a organizáciami pre kritické aplikácie
5. MongoDB: Populárny NoSQL databázový systém orientovaný na dokumenty, vhodný pre aplikácie, ktoré vyžadujú rýchle spracovanie veľkého množstva nestrukturovaných dát
6. SQLite: Ľahká, embeddable databáza, ktorá nevyžaduje samostatný serverový proces, často používaná v mobilných aplikáciách a malých webových projektoch
7. IBM DB2: Výkonný komerčný DBMS, ktorý sa používa v rôznych podnikových a analytických aplikáciách
8. Apache Cassandra: Škálovateľný, vysokovýkonný distribuovaný NoSQL DBMS, navrhnutý pre spracovanie veľkých objemov dát rozložených naprieč mnohými servermi
9. Redis: Výkonný databázový systém v pamäti, ktorý sa často používa ako vyrovnávacia pamäť alebo na ukladanie dát v reálnom čase
10. Amazon DynamoDB: Plne spravovaná NoSQL databázová služba poskytovaná Amazon Web Services, navrhnutá pre jednoduché škálovanie a vysokú dostupnosť

# 1. Ktorý databázový systém je najpoužívanejší na svete a prečo?

# 2. Ktorý databázový systém je najpoužívanejší pre webstránkach a eshopoch?

# Pripojenie sa na DB

## 🐬 MySQL 
Inštalátor: https://dev.mysql.com/downloads/mysql/ | https://www.wampserver.com/en/  
Porty: 3306-3311  
User: root  
Heslo: bez (Wamp)/vase(MySql installer)  
JDBC driver: https://dev.mysql.com/downloads/connector/j/  

##  🐘 PostgreSQL 
Inštalátor: https://www.postgresql.org/download/windows/  
Porty: 5432  
User: postgres  
Heslo: vase(PostgreSQL installer)  
JDBC driver: https://jdbc.postgresql.org/download.html  

##  🎩 Apache Derby  
Inštalátor: https://db.apache.org/derby/derby_downloads.html  
Porty: 1527  

##  ☁️ Oracle DB  
Inštalátor: https://www.oracle.com/database/technologies/appdev/xe.html  
Porty: 1521  
SID: xe  

##  🦢 SQLite  
Inštalátor: https://www.sqlite.org/download.html  
Porty: nemá porty

## 🗄️ Údaje na Testovacie Pripojenie na Databázu na DOMA
### 🐬 MySQL 
**Hostiteľ [host]:** mysql57.r2.websupport.sk  
Databáza [database/schema]: Kurz_DB_SQL  
**Používateľ [user]:** Kurz_DB_SQL  
Heslo [password]: Buduci_analytik123  
**Port:** 3311  

### 🐘 PostgreSQL 
**Hostiteľ [host]:** postgresql.r2.websupport.sk  
Databáza [database/schema]: Kurz_VAVA_JDBC  
**Používateľ [user]:** Kurz_VAVA_JDBC  
Heslo [password]: Kurz_java_developeri_2023  
**Port:** 5432

# Výpis Všetkých Tabuliek (Tabuliek)

In [1]:
show tables;

,Tables_in_DB_MySQL
0,DEPT
1,EMP
2,Studenti
3,T1
4,T10
5,T100
6,Znamky
7,nobel
8,world

# Prvé Dopyty v Jazyku SQL (Selecty)

In [2]:
select * from world;

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+05,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+05,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...
...,...,...,...,...,...,...,...,...
190,Venezuela,South America,916445,28946101,3.824240e+05,Caracas,.ve,//upload.wikimedia.org/wikipedia/commons/0/06/...
191,Vietnam,Asia,331212,89708900,1.558200e+04,Hanoi,.vn,//upload.wikimedia.org/wikipedia/commons/2/21/...
192,Yemen,Asia,527968,25235000,3.283100e+10,Sana‘a,.ye,//upload.wikimedia.org/wikipedia/commons/8/89/...
193,Zambia,Africa,752612,15023315,2.149000e+10,Lusaka,.zm,//upload.wikimedia.org/wikipedia/commons/0/06/...
194,Zimbabwe,Africa,390757,13061239,9.802000e+09,Harare,.zw,//upload.wikimedia.org/wikipedia/commons/6/6a/...

# Identifikácia DB

# 🕵️ Identifikácia DB
1. Technologický stack webovej stránky
2. Dokumentácia alebo technické podrobnosti na webovej stránke
3. Analýza HTTP hlavičky a kód stránky
4. Kontakt vývojárov alebo správcov stránky
5. Vyhľadávanie na internete
6. Chybové hlášky
7. Nástroje na reverzné inžinierstvo a hack

# Technologický Profil/Stack webovej stránky

**Wappalyer**  
https://chromewebstore.google.com/detail/wappalyzer-technology-pro/gppongmhjkpfnbhagpmjfkannfbllamg  

**BuilthWith**  
https://chromewebstore.google.com/detail/builtwith-technology-prof/dapjbgnjinbpoindlpdmhochffioedbn

# Dokumentácia alebo technické podrobnosti na webovej stránke

# Chybové Hlášky

# SQL

# 👌 Jazyk SQL
* Skratka pre „Structured Query Language“ (Štruktúrovaný dopytovací jazyk), 
* Je štandardný jazyk používaný na správu a manipuláciu s dátami v relačných databázových systémoch. 
* Umožňuje vytvárať, upravovať, spravovať a dotazovať sa na databázy, čo zahŕňa operácie ako vkladanie, aktualizácia, mazanie a vyberanie dát. Jazyk SQL je široko používaný v oblasti databázového programovania a správy dát.  
  
1. DQL – Data Query Language
2. DML – Data Manipulation Language
3. DDL – Data Definition Language
4. DCL – Data Control Language

# SQL Jazyk – DML

1. SELECT – výber dát  
2. INSERT – vloženie dát 
3. UPDATE – aktualizácia dát 
4. DELETE – zmazanie dát 
5. UPSERT – aktualizácia a súčasne vkladanie dát

# Vlastnosti jazyka SQL
1. Medzery navyše sú ignorované
2. Nie je senzitívny na veľkosť písmen
3. Príkazy sú oddeľované bodkočiarkou
4. Klauzuly sú špeciálne kľúčové slová
5. Výrazy vracajú skalárne hodnoty alebo tabuľky
6. Predikát predstavuje podmienku – 3–hodnotová logika

In [4]:
SELECT * FROM EMP;

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,7369,SMITH,CLERK,7902.0,1980-12-17,800,NaN,20
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,300.0,30
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,500.0,30
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,NaN,20
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,1400.0,30
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850,NaN,30
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450,NaN,10
7,7788,SCOTT,ANALYST,7566.0,1982-12-09,3000,NaN,20
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000,NaN,10
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500,0.0,30
10,7876,ADAMS,CLERK,7788.0,1983-01-12,1100,NaN,20
11,7900,JAMES,CLERK,7698.0,1981-12-03,950,NaN,30
12,7902,FORD,ANALYST,7566.0,1981-12-03,3000,NaN,20
13,7934,MILLER,CLERK,7782.0,1982-01-23,1300,NaN,10

In [8]:
-- Jednoriadkovy komentar
/*
    Autor: Miroslav Reiter
    Verzia: 1.0
*/
# Jednoriadkovy komentar
SELECT * FROM world;

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+05,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+05,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...
...,...,...,...,...,...,...,...,...
385,Venezuela,South America,916445,28946101,3.824240e+05,Caracas,.ve,//upload.wikimedia.org/wikipedia/commons/0/06/...
386,Vietnam,Asia,331212,89708900,1.558200e+04,Hanoi,.vn,//upload.wikimedia.org/wikipedia/commons/2/21/...
387,Yemen,Asia,527968,25235000,3.283100e+10,Sana‘a,.ye,//upload.wikimedia.org/wikipedia/commons/8/89/...
388,Zambia,Africa,752612,15023315,2.149000e+10,Lusaka,.zm,//upload.wikimedia.org/wikipedia/commons/0/06/...
389,Zimbabwe,Africa,390757,13061239,9.802000e+09,Harare,.zw,//upload.wikimedia.org/wikipedia/commons/6/6a/...

In [10]:
select * from world limit 5;
select * from EMP limit 5;

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,7369,SMITH,CLERK,7902,1980-12-17,800,NaN,20
1,7499,ALLEN,SALESMAN,7698,1981-02-20,1600,300.0,30
2,7521,WARD,SALESMAN,7698,1981-02-22,1250,500.0,30
3,7566,JONES,MANAGER,7839,1981-04-02,2975,NaN,20
4,7654,MARTIN,SALESMAN,7698,1981-09-28,1250,1400.0,30

In [12]:
select * from world limit 4,5;

,name,continent,area,population,gdp,capital,tld,flag
0,Angola,Africa,1246700,19183590,1.163080e+05,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...
1,Antigua and Barbuda,Caribbean,442,86295,1.176000e+09,St. John's,.ag,//upload.wikimedia.org/wikipedia/commons/8/89/...
2,Argentina,South America,2780400,42669500,4.770280e+05,Buenos Aires,.ar,//upload.wikimedia.org/wikipedia/commons/1/1a/...
3,Armenia,Eurasia,29743,3017400,9.950000e+09,Yerevan,.am,//upload.wikimedia.org/wikipedia/commons/2/2f/...
4,Australia,Oceania,7692024,23545500,1.564420e+05,Canberra,.au,//upload.wikimedia.org/wikipedia/commons/b/b9/...

In [13]:
# Filter - where
select * from world
where name = "Slovakia"

,name,continent,area,population,gdp,capital,tld,flag
0,Slovakia,Europe,49037,5415949,9.134900e+10,Bratislava,.sk,//upload.wikimedia.org/wikipedia/commons/e/e6/...
1,Slovakia,Europe,49037,5415949,9.134900e+10,Bratislava,.sk,//upload.wikimedia.org/wikipedia/commons/e/e6/...

In [15]:
select capital, population, name, population
from world

,capital,population,name,population
0,Kabul,25500100,Afghanistan,25500100
1,Tirana,2821977,Albania,2821977
2,Algiers,38700000,Algeria,38700000
3,Andorra la Vella,76098,Andorra,76098
4,Luanda,19183590,Angola,19183590
...,...,...,...,...
385,Caracas,28946101,Venezuela,28946101
386,Hanoi,89708900,Vietnam,89708900
387,Sana‘a,25235000,Yemen,25235000
388,Lusaka,15023315,Zambia,15023315
389,Harare,13061239,Zimbabwe,13061239

In [18]:
select name, population, area
from world
where name = "Slovakia"
or name = "Poland"
or name = "Hungary"

,name,population,area
0,Hungary,9879000,93028
1,Poland,38496000,312679
2,Slovakia,5415949,49037
3,Hungary,9879000,93028
4,Poland,38496000,312679
5,Slovakia,5415949,49037

In [19]:
select name, population, area
from world
where name in ("Hungary", "Slovakia", "Poland")

,name,population,area
0,Hungary,9879000,93028
1,Poland,38496000,312679
2,Slovakia,5415949,49037
3,Hungary,9879000,93028
4,Poland,38496000,312679
5,Slovakia,5415949,49037

In [21]:
select name, continent, population
from world
where population between 5000000 and 10000000

,name,continent,population
0,Austria,Europe,8504850
1,Azerbaijan,Asia,9477100
2,Belarus,Europe,9467000
3,Benin,Africa,9988068
4,Bulgaria,Europe,7245677
...,...,...,...
59,Switzerland,Europe,8160900
60,Tajikistan,Asia,8160000
61,Togo,Africa,6993000
62,Turkmenistan,Asia,5307000
63,United Arab Emirates,Asia,9446000

In [22]:
select * from EMP
where sal BETWEEN 1000 and 2500;

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,7499,ALLEN,SALESMAN,7698,1981-02-20,1600,300.0,30
1,7521,WARD,SALESMAN,7698,1981-02-22,1250,500.0,30
2,7654,MARTIN,SALESMAN,7698,1981-09-28,1250,1400.0,30
3,7782,CLARK,MANAGER,7839,1981-06-09,2450,NaN,10
4,7844,TURNER,SALESMAN,7698,1981-09-08,1500,0.0,30
5,7876,ADAMS,CLERK,7788,1983-01-12,1100,NaN,20
6,7934,MILLER,CLERK,7782,1982-01-23,1300,NaN,10

In [27]:
# order by (Zotried)

/* select name, population from world
order by name DESC */

select name, population from world
order by population ASC

,name,population
0,Vatican City,839
1,Vatican City,839
2,Nauru,9945
3,Nauru,9945
4,Tuvalu,11323
...,...,...
385,United States,318320000
386,India,1246160000
387,India,1246160000
388,China,1365370000
389,China,1365370000

In [30]:
# Distinct, Group by Zoskupenie
select distinct continent from world
order by continent;

,continent
0,Africa
1,Asia
2,Caribbean
3,Eurasia
4,Europe
5,North America
6,Oceania
7,South America

In [32]:
# Distinct, Group by Zoskupenie
select continent from world
group by continent
order by continent;

,continent
0,Africa
1,Asia
2,Caribbean
3,Eurasia
4,Europe
5,North America
6,Oceania
7,South America

In [34]:
/*select count(*)
from world;*/

select count(name)
from world;

,count(name)
0,390

In [35]:
select *
from world;

,name,continent,area,population,gdp,capital,tld,flag
0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...
1,Albania,Europe,28748,2821977,1.204400e+10,Tirana,.al,//upload.wikimedia.org/wikipedia/commons/3/36/...
2,Algeria,Africa,2381741,38700000,2.070210e+05,Algiers,.dz,//upload.wikimedia.org/wikipedia/commons/7/77/...
3,Andorra,Europe,468,76098,3.222000e+09,Andorra la Vella,.ad,//upload.wikimedia.org/wikipedia/commons/1/19/...
4,Angola,Africa,1246700,19183590,1.163080e+05,Luanda,.ao,//upload.wikimedia.org/wikipedia/commons/9/9d/...
...,...,...,...,...,...,...,...,...
385,Venezuela,South America,916445,28946101,3.824240e+05,Caracas,.ve,//upload.wikimedia.org/wikipedia/commons/0/06/...
386,Vietnam,Asia,331212,89708900,1.558200e+04,Hanoi,.vn,//upload.wikimedia.org/wikipedia/commons/2/21/...
387,Yemen,Asia,527968,25235000,3.283100e+10,Sana‘a,.ye,//upload.wikimedia.org/wikipedia/commons/8/89/...
388,Zambia,Africa,752612,15023315,2.149000e+10,Lusaka,.zm,//upload.wikimedia.org/wikipedia/commons/0/06/...
389,Zimbabwe,Africa,390757,13061239,9.802000e+09,Harare,.zw,//upload.wikimedia.org/wikipedia/commons/6/6a/...

In [36]:
select *, cast(HIREDATE as char) from EMP;

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,cast(HIREDATE as char)
0,7369,SMITH,CLERK,7902.0,1980-12-17,800,NaN,20,1980-12-17
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,300.0,30,1981-02-20
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,500.0,30,1981-02-22
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,NaN,20,1981-04-02
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,1400.0,30,1981-09-28
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850,NaN,30,1981-05-01
6,7782,CLARK,MANAGER,7839.0,1981-06-09,2450,NaN,10,1981-06-09
7,7788,SCOTT,ANALYST,7566.0,1982-12-09,3000,NaN,20,1982-12-09
8,7839,KING,PRESIDENT,NaN,1981-11-17,5000,NaN,10,1981-11-17
9,7844,TURNER,SALESMAN,7698.0,1981-09-08,1500,0.0,30,1981-09-08
10,7876,ADAMS,CLERK,7788.0,1983-01-12,1100,NaN,20,1983-01-12
11,7900,JAMES,CLERK,7698.0,1981-12-03,950,NaN,30,1981-12-03
12,7902,FORD,ANALYST,7566.0,1981-12-03,3000,NaN,20,1981-12-03
13,7934,MILLER,CLERK,7782.0,1982-01-23,1300,NaN,10,1982-01-23

In [37]:
select cast('2023-11-29' as date);

,cast('2023-11-29' as date)
0,2023-11-29

# Test DB

In [1]:
show tables;

,Tables_in_DB_MySQL
0,DEPT
1,EMP
2,Studenti
3,T1
4,T10
5,T100
6,Znamky
7,nobel
8,world

In [2]:
show tables;

,Tables_in_DB_MySQL
0,DEPT
1,EMP
2,Studenti
3,T1
4,T10
5,T100
6,Znamky
7,nobel
8,world